window.GAME_DATA = {
  "version": "0.4.0",
  "intro": {
    "phone": [
      {
        "speaker": "寇恩",
        "text": "⋯⋯您好？",
        "reply": "你好，是帕普家的小兒子嗎？"
      },
      {
        "speaker": "寇恩",
        "text": "我是帕普寇恩沒錯，請問你們是？",
        "teamInput": true
      },
      {
        "speaker": "player",
        "text": "我們是 {{team}}，是來幫你尋找你的家人的。"
      },
      {
        "speaker": "寇恩",
        "text": "哇！很高興認識你們！{{team}}！你們有找到什麼線索嗎？",
        "reply": "目前沒有，我們打算到光之電影院找找看有什麼線索"
      },
      {
        "speaker": "寇恩",
        "text": "很有道理，我也正打算過去，那我們等等在光之電影院見面嗎？",
        "reply": "沒問題"
      }
    ]
  },
  "firstTheater": {
    "hotdog": [
      [
        "哈斗哥",
        "現在開放進場的是近期熱映的香港電影《沒有人付錢》！"
      ],
      [
        "寇恩",
        "我們想來問有關我家米花的事情！"
      ],
      [
        "哈斗哥",
        "哎呀！狗沒拿賽！"
      ],
      [
        "哈斗哥",
        "我也很想幫忙，但你們這樣沒頭沒尾的問我，我實在不知道怎麼幫助你們。"
      ],
      [
        "player",
        "你對昨天來看電影的爆米花有印象嗎？"
      ],
      [
        "哈斗哥",
        "有啊！他們就是一群白白的可愛小傢伙！"
      ],
      [
        "哈斗哥",
        "聞起來有焦糖、巧克力、起司、奶油的味道。"
      ],
      [
        "哈斗哥",
        "如何？是你們要找的爆米花嗎？"
      ],
      [
        "player",
        "聽起來就像是對所有爆米花的敘述一樣⋯⋯"
      ],
      [
        "哈斗哥",
        "哈哈哈哈哈！說得也是！我真是粗心大意呢！"
      ],
      [
        "寇恩",
        "那請您讓我進去，我自己去找！"
      ],
      [
        "哈斗哥",
        "呀勒呀勒！不可以得斯！"
      ],
      [
        "哈斗哥",
        "要進去的話一定得買票才行！"
      ]
    ],
    "churro": [
      [
        "丘洛",
        "歡迎來光之電影院，幾位？要看什麼電影？"
      ],
      [
        "寇恩",
        "請問妳有看到我的家米花嗎？"
      ],
      [
        "丘洛",
        "啊？誰知道你家拿棒是誰啊？"
      ],
      [
        "寇恩",
        "就是這些爆米花。"
      ],
      [
        "丘洛",
        "沒印象。"
      ],
      [
        "寇恩",
        "那妳知道昨天的爆米花看了什麼電影嗎？"
      ],
      [
        "丘洛",
        "拜託，我怎麼會知道？"
      ],
      [
        "丘洛",
        "你知道一整天下來，來看電影的爆米花有幾顆嗎？"
      ],
      [
        "player",
        "丘洛小姐，能不能請妳提供一些線索？"
      ],
      [
        "player",
        "寇恩真的很著急想要找到他的家人。"
      ],
      [
        "丘洛",
        "好吧。"
      ],
      [
        "丘洛",
        "這裡有一張電影簡介表，也許你們能從中找看看有沒有什麼線索。"
      ]
    ]
  },
  "clueDialogue": {
    "intro": [
      [
        "寇恩",
        "我只聽說他們昨天要來看電影，完全不知道他們要看什麼⋯⋯"
      ],
      [
        "player",
        "你跟家人的感情好嗎？"
      ],
      [
        "寇恩",
        "我們喜歡爆抱，這樣算是感情好嗎？"
      ],
      [
        "player",
        "我的意思是，你知道他們昨天的行蹤嗎？"
      ],
      [
        "寇恩",
        "哦～當然知道呀！"
      ],
      [
        "寇恩",
        "媽媽說她下午3點要去逛水晶市集，4點半才會回家。"
      ],
      [
        "寇恩",
        "烏拉早上10點會待在家裡看播一個小時的卡通。"
      ],
      [
        "寇恩",
        "爺爺每天晚上10點一定要上床睡覺。"
      ],
      [
        "寇恩",
        "希波早上8點會去實驗室，至少會待2個小時。"
      ],
      [
        "寇恩",
        "中午12點到下午1點半是平的練舞時間。"
      ],
      [
        "寇恩",
        "爸爸昨天好像沒什麼行程的樣子。"
      ],
      [
        "寇恩",
        "史塔兒下午2點半跟晚上8點都有客人，每次時間半個小時。"
      ],
      [
        "寇恩",
        "希可去北極探險了，前天晚上9點上飛機，應該10個小時後飛回來。"
      ],
      [
        "player",
        "這樣應該可以推算出他們看電影的時間了。"
      ],
      [
        "player",
        "那他們都看什麼樣的電影呢？"
      ],
      [
        "寇恩",
        "我想想⋯⋯我自己不看片長超過兩小時的電影。"
      ],
      [
        "寇恩",
        "史塔兒對所有海報有星星的電影都會感興趣。"
      ],
      [
        "寇恩",
        "爸爸不喜歡燒腦片。"
      ],
      [
        "寇恩",
        "希可對有冒險元素的電影情有獨鍾。"
      ],
      [
        "寇恩",
        "爺爺不敢看太血腥的電影。"
      ],
      [
        "寇恩",
        "烏拉還小，只要電影出品商名字有英文就會笑得很開心。"
      ],
      [
        "寇恩",
        "平只要看到電影裡有小偷就會渾身不自在。"
      ],
      [
        "寇恩",
        "恐怖片媽媽都不會參與，就算只有一點點恐怖也不行。"
      ],
      [
        "寇恩",
        "希波對劇情片沒什麼興趣。"
      ]
    ],
    "scheduleRepeat": [
      [
        "寇恩",
        "媽媽說她下午3點要去逛水晶市集，5點才會回家。"
      ],
      [
        "寇恩",
        "烏拉早上10點會待在家裡看播一個小時的卡通。"
      ],
      [
        "寇恩",
        "爺爺每天晚上10點一定要上床睡覺。"
      ],
      [
        "寇恩",
        "希波早上8點會去實驗室，至少會待2個小時。"
      ],
      [
        "寇恩",
        "中午12點到下午1點半是平的練舞時間。"
      ],
      [
        "寇恩",
        "爸爸昨天好像沒什麼行程的樣子。"
      ],
      [
        "寇恩",
        "史塔兒下午2點半跟晚上8點都有客人，每次時間半個小時。"
      ],
      [
        "寇恩",
        "希可去北極探險了，昨天晚上9點上飛機，應該10個小時後飛回來。"
      ]
    ],
    "preferenceRepeat": [
      [
        "寇恩",
        "我自己不看片長超過兩小時的電影。"
      ],
      [
        "寇恩",
        "史塔兒對所有海報有星星的電影都會感興趣。"
      ],
      [
        "寇恩",
        "爸爸不喜歡戰爭片。"
      ],
      [
        "寇恩",
        "希可對有冒險元素的電影情有獨鍾。"
      ],
      [
        "寇恩",
        "爺爺不敢看太血腥的電影。"
      ],
      [
        "寇恩",
        "烏拉還小，只要電影出品商名字有英文就會笑得很開心。"
      ],
      [
        "寇恩",
        "平只要看到電影裡有小偷就會渾身不自在。"
      ],
      [
        "寇恩",
        "恐怖片媽媽都不會參與，就算只有一點點恐怖也不行。"
      ],
      [
        "寇恩",
        "希波對愛情片沒什麼興趣。"
      ]
    ]
  },
  "secondTheater": {
    "hotdogNoTicket": [
      [
        "哈斗哥",
        "《沒有人付錢》即將開演，請儘速驗票入場哦！"
      ],
      [
        "寇恩",
        "我要進去找我的家米花。"
      ],
      [
        "哈斗哥",
        "狗沒拿賽～有買票才能入場哦～"
      ],
      [
        "哈斗哥",
        "狗沒拿賽～有買票才能入場哦～"
      ]
    ],
    "churroTicket": [
      [
        "丘洛",
        "我不是已經給你們電影時刻表了嗎？"
      ],
      [
        "寇恩",
        "我們找到了！他們看的是下午5點20分的《幸福的甜蜜滋味》。"
      ],
      [
        "丘洛",
        "所以呢？你還想要什麼？"
      ],
      [
        "player",
        "至少可以告訴我們他們在哪個影廳吧？"
      ],
      [
        "丘洛",
        "⋯⋯他們在第18影廳。"
      ],
      [
        "寇恩",
        "謝謝妳！漂亮的姐姐。"
      ],
      [
        "丘洛",
        "等一下，小鬼。"
      ],
      [
        "寇恩",
        "怎⋯⋯怎麼了嗎？"
      ],
      [
        "丘洛",
        "這裡有電影票，給售票口那傢伙他應該就會讓你們進去了。"
      ],
      [
        "player",
        "妳沒有想像中那麼壞嘛。"
      ]
    ],
    "churroRepeat": [
      [
        "丘洛",
        "我沒有東西可以給你們了，後面還有很多人要買票。"
      ]
    ],
    "hotdogTicket": [
      [
        "哈斗哥",
        "《沒有人付錢》即將開演，請儘速驗票入場哦！"
      ],
      [
        "寇恩",
        "我們要入場。"
      ],
      [
        "哈斗哥",
        "沒有問題得斯！這邊為您驗票入場～"
      ],
      [
        "哈斗哥",
        "啾抖媽得。"
      ],
      [
        "哈斗哥",
        "這不是《沒有人付錢》的電影票哪？"
      ],
      [
        "寇恩",
        "拜託了，我真的很想找到我的家米花！"
      ],
      [
        "哈斗哥",
        "話雖如此，你知道他們在第幾影廳嗎？"
      ]
    ],
    "hallCorrect": [
      [
        "哈斗哥",
        "我知道了！"
      ],
      [
        "哈斗哥",
        "昨天第18影廳的觀眾都是爆米花，所以我有點印象。"
      ],
      [
        "哈斗哥",
        "這裡有一些票根，希望可以幫助到你們。"
      ],
      [
        "寇恩",
        "謝謝你！香腸堡哥哥！"
      ],
      [
        "哈斗哥",
        "我是熱狗堡啦！"
      ],
      [
        "player",
        "票根上的物品是什麼意思？"
      ],
      [
        "哈斗哥",
        "為了防止客人攜帶危險物品或是有東西弄丟，我們都會要求大家把要帶進去的東西做登記。"
      ],
      [
        "player",
        "那你昨天有注意到他們沒有散場嗎？"
      ],
      [
        "哈斗哥",
        "電影結束前觀眾就離開的事情蠻常發生的，所以我沒當回事。"
      ],
      [
        "player",
        "整理影廳的時候有沒有哪裡很奇怪呢？"
      ],
      [
        "哈斗哥",
        "這倒是沒有。"
      ],
      [
        "哈斗哥",
        "不過為了提供大家舒適服務，我們會提前把賣出的座位往下壓好。"
      ],
      [
        "哈斗哥",
        "這樣大家坐下的時候就會很舒服了，哈哈哈哈！"
      ],
      [
        "寇恩",
        "謝謝你的告知⋯⋯？"
      ]
    ]
  },
  "hall18": {
    "intro": [
      [
        "寇恩",
        "他們真的不在這裡⋯⋯"
      ],
      [
        "player",
        "別太難過，我們先找到他們分別坐在哪裡吧。"
      ],
      [
        "寇恩",
        "嗯？好像出現了什麼東西？"
      ],
      [
        "寇恩",
        "觀眾席底部出現了⋯⋯"
      ]
    ],
    "afterFindings": [
      [
        "寇恩",
        "座位底下好像有什麼東西！"
      ],
      [
        "player",
        "是什麼？"
      ],
      [
        "寇恩",
        "是我家米花們的物品！但他們好像都有東西不見了⋯⋯"
      ]
    ],
    "afterSeats": [
      [
        "寇恩",
        "這些都確定是我家米花的東西，他們真的在這裡消失了！"
      ],
      [
        "player",
        "你冷靜一點，我們一定可以找到他們的。"
      ],
      [
        "寇恩",
        "要怎麼找？難道要電影院整個翻遍嗎？"
      ],
      [
        "player",
        "⋯⋯"
      ],
      [
        "player",
        "沒錯，就是要把整個電影院翻遍。"
      ],
      [
        "寇恩",
        "你有找到什麼嗎？"
      ]
    ],
    "envelope": [
      [
        "寇恩",
        "會不會是有誰掉在這裡了？"
      ],
      [
        "寇恩",
        "我們先別輕舉妄動，不要打開好了。"
      ]
    ],
    "film": [
      [
        "寇恩",
        "這看起來⋯⋯是這部電影的膠片耶。"
      ],
      [
        "寇恩",
        "難道這個膠片會有線索？"
      ],
      [
        "player",
        "我好像看到了五個英文字母⋯⋯"
      ]
    ],
    "curtain": [
      [
        "寇恩",
        "唔！我們該把紅色帷幕拉開看看嗎？"
      ]
    ],
    "rolling": [
      [
        "寇恩",
        "我們是要去划船了嗎？"
      ],
      [
        "player",
        "我覺得 Rolling 應該是指拍攝電影的機器在轉動的意思⋯⋯"
      ]
    ]
  },
  "seats": {
    "1A": {
      "person": "希可",
      "items": [
        "指南針",
        "登山繩",
        "保溫瓶",
        "手電筒",
        "雪花蒐集冊"
      ],
      "missing": "雪花蒐集冊"
    },
    "2A": {
      "person": "葛蘭德",
      "items": [
        "領結",
        "懷錶",
        "手帕",
        "鑰匙串",
        "管家守則"
      ],
      "missing": "管家守則"
    },
    "3A": {
      "person": "烏拉",
      "items": [
        "蠟筆",
        "髮夾",
        "貼紙",
        "糖果盒",
        "小熊布偶"
      ],
      "missing": "貼紙"
    },
    "4A": {
      "person": "蘿莉",
      "items": [
        "羅盤",
        "衛生紙",
        "棒棒糖",
        "迷宮手札",
        "紫水晶吊墜"
      ],
      "missing": "迷宮手札"
    },
    "1B": {
      "person": "希波",
      "items": [
        "量杯",
        "護目鏡",
        "試管組",
        "白板筆",
        "元素週期表"
      ],
      "missing": "量杯"
    },
    "2B": {
      "person": "史塔兒",
      "items": [
        "望遠鏡",
        "塔羅牌",
        "水晶球",
        "星座大全",
        "星星玻璃瓶"
      ],
      "missing": "星座大全"
    },
    "3B": {
      "person": "平",
      "items": [
        "毛巾",
        "安全帽",
        "藍牙耳機",
        "音響喇叭",
        "編舞筆記"
      ],
      "missing": "編舞筆記"
    },
    "4B": {
      "person": "巴柏",
      "items": [
        "帽子",
        "木頭湯匙",
        "萬用調味罐",
        "泡泡保鮮膜",
        "風味筆記本"
      ],
      "missing": "泡泡保鮮膜"
    }
  }
};
